/* Localizers: These values are only used in charts right now (but also taken into account for automatically picking import columns) */

/* all */
amazonProductGroup = "amazon product groups";
asin = "amazon links";
associatedURL = "urls";
audienceRecommendedAgeSingularString = "audiences";
boxHeightInInches = "heights";
boxLengthInInches = "lengths";
boxWeightInPounds = "weights";
boxWidthInInches = "widths";
coverImageLargeURLString = "your image URLs";
coverImageColorsCompositeString = "cover colors";
creationDate = "creation dates";
creatorsCompositeString = "creators";
creatorsCompositeString.Book = "authors";
creatorsCompositeString.Movie = "directors";
creatorsCompositeString.Music = "artists";
creatorsCompositeString.Software = "developers";
creatorsCompositeString.VideoGame = "studios";
creatorsCompositeString.Toy = "companies";
creatorsCompositeString.Gadget = "manufacturers";
creatorsCompositeString.Tool = "manufacturers";
creatorsCompositeString.Apparel = "labels";
creatorsCompositeString.iTunesAlbum = "artists";
creatorsCompositeString.iTunesAudiobook = "authors";
creatorsCompositeString.iTunesMovie = "directors";
creatorsCompositeString.iTunesShow = "creators";
creatorsCompositeString.iTunesBook = "authors";
countryCode = "countries";
currentValue = "current values";
ean = "EANs";
editionsCompositeString = "editions";
featuresCompositeString = "features";
formatSingularString = "formats";
genresCompositeString = "genres";
key = "keys";
languagesCompositeString = "languages";
lastLookupTime = "lookup times";
minimumPlayers = "minimum players";
maximumPlayers = "maximum players";
netRating = "net ratings";
numberInSeries = "no. in series";
numberOfMedia = "no. of items";
price = "retail prices";
publishDate = "release dates";

publishersCompositeString = "publishers";
publishersCompositeString.Book = "publishers";
publishersCompositeString.Movie = "studios";
publishersCompositeString.Music = "labels";
publishersCompositeString.Software = "companies";
publishersCompositeString.VideoGame = "publishers";
publishersCompositeString.Toy = "companies";
publishersCompositeString.Gadget = "sold by";
publishersCompositeString.Tool = "sold by";
publishersCompositeString.Apparel = "labels";
publishersCompositeString.iTunesAlbum = "labels";
publishersCompositeString.iTunesAudiobook = "publishers";
publishersCompositeString.iTunesMovie = "studios";
publishersCompositeString.iTunesShow = "networks";
publishersCompositeString.iTunesBook = "publishers";

rare = "rare";
seriesSingularString = "series";
subtitle = "subtitles";

title = "titles";
title.Book = "titles";
title.Movie = "titles";
title.Music = "albums";
title.Software = "titles";
title.VideoGame = "titles";
title.Toy = "names";
title.Gadget = "names";
title.Tool = "names";
title.Apparel = "names";
title.iTunesAlbum = "albums";
title.iTunesAudiobook = "titles";
title.iTunesMovie = "titles";
title.iTunesShow = "names";
title.iTunesBook = "titles";

type = "item types";
uuidString = "unique item keys";
widthLengthHeightString = "dimensions";

/* all - my info */
buyPrice = "purchase prices";
conditionSingularString = "conditions";

hasExperienced = "played / read";
hasExperienced.Book = "read";
hasExperienced.Movie = "watched";
hasExperienced.Music = "played";
hasExperienced.Software = "launched";
hasExperienced.VideoGame = "played";
hasExperienced.Toy = "played";
hasExperienced.Gadget = "played";
hasExperienced.Tool = "played";
hasExperienced.Apparel = "worn";
hasExperienced.iTunesAlbum = "played";
hasExperienced.iTunesAudiobook = "played";
hasExperienced.iTunesMovie = "watched";
hasExperienced.iTunesShow = "watched";
hasExperienced.iTunesBook = "read";

isSigned = "signed";
locationSingularString = "locations";
containingShelfTitlesCompositeString = "shelves";
notes = "notes";
ownerSingularString = "owners";
privateCollection = "private";
purchaseDate = "purchase dates";
rating = "ratings";
used = "used";

/* books */
deweyDecimal = "dewey decimals";
illustratorsCompositeString = "illustrators";
isbn = "ISBNs";
libraryOfCongressCallNumber = "library of congress";
pages = "pages";

/* movies */
actorsCompositeString = "stars";
cinematographersCompositeString = "cinematographers";
minutes = "running times"; /* also music */

screenwritersCompositeString = "screenwriters";
theatricalDate = "theatrical debuts";

/* music */
composersCompositeString = "composers";
conductorsCompositeString = "conductors";
tracksCompositeString = "tracks";
minutes.Music = "times"; /* also movies */

/* games */
platformsCompositeString = "platforms";
players = "players";

/* software | electronics - my info  */
serialNumber = "serial numbers";

/* loans */
"loan.borrower.fullName" = "lent to";
"loan.dueDate" = "due dates";
"loan.daysOverdue" = "days overdue";
"loan.notes" = "loan notes";
"loan.remindBeforeDays" = "reminders";

/* virtual, used for smart shelves */
"amazonSynopses" = "synopses";
"userSynopsis" = "your synopses";

/* virtual, used for search field */
primaryDescriptionAttributedString = "primary synopses";
"primaryDescriptionString" = "primary synopses";

/* virtual, used for undo */
"userSynopsisAttributedString" = "synopses";
